soap/spec/request2.xml

<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
    <env:Body>
        <wd:Edit_Worker_Additional_Data_Response wd:version="v25.0" xmlns:wd="urn:com.workday/bsvc">
            <wd:Event_Reference
                wd:Descriptor="Edit ~Worker~ Additional Data Event: Logan McNeil (CHRO, HRExe, Mgr 4000, MatMgr, ProMgr,TalMgr,VPRept) - Chief Human Resources Officer on 08/21/2015">
                <wd:ID wd:type="WID">9358fdb7118a100017a32d71c3600023</wd:ID>
            </wd:Event_Reference>
            <wd:Worker_Reference
                wd:Descriptor="Logan McNeil (CHRO, HRExe, Mgr 4000, MatMgr, ProMgr,TalMgr,VPRept)">
                <wd:ID wd:type="WID">3aa5550b7fe348b98d7b5741afc65534</wd:ID>
                <wd:ID wd:type="Employee_ID">21001</wd:ID>
            </wd:Worker_Reference>
            <wd:Effective_Date>2015-08-21-07:00</wd:Effective_Date>
            <wd:Additional_Data>
                <custom:companyCar wd:Descriptor=""
                    xmlns:custom="urn:com.workday/tenants/super/data/custom">
                    <custom:companyCarReference>
                        <custom:ID custom:type="WID">9358fdb7118a300017a33264aa160027</custom:ID>
                    </custom:companyCarReference>
                    <custom:carNumber>54</custom:carNumber>
                    <custom:cost custom:Currency_ID="USD">32000</custom:cost>
                    <custom:datePurchased>2014-10-08</custom:datePurchased>
                    <custom:makeAndModel>Ford Fusion</custom:makeAndModel>
                </custom:companyCar>
                <custom:companyPhone wd:Descriptor="Initial issue"
                    xmlns:custom="urn:com.workday/tenants/super/data/custom">
                    <custom:companyPhoneReference>
                        <custom:ID custom:type="WID">9358fdb7118a300017a332134fd20026</custom:ID>
                        <custom:ID custom:type="serialNumber">1000</custom:ID>
                    </custom:companyPhoneReference>
                    <custom:description>Initial issue</custom:description>
                    <custom:serialNumber>1000</custom:serialNumber>
                    <custom:phoneModel wd:Descriptor="iPhone 6">
                        <custom:ID custom:type="WID">64d9653bfe8a100005ad384099bb0024</custom:ID>
                    </custom:phoneModel>
                </custom:companyPhone>
            </wd:Additional_Data>
        </wd:Edit_Worker_Additional_Data_Response>
    </env:Body>
</env:Envelope>


<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <wd:Get_Candidates_Request xmlns:wd="urn:com.workday/bsvc">
            <wd:Request_References>
                <wd:Candidate_Reference>
                    <wd:ID wd:type="WID">8828a84896248192f4886d9ad4556514</wd:ID>
                </wd:Candidate_Reference>
            </wd:Request_References>
            <wd:Response_Filter>
                <wd:Count>1</wd:Count>
            </wd:Response_Filter>
        </wd:Get_Candidates_Request>
    </soap:Body>
</soap:Envelope>


<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <wd:Get_Workers_Request xmlns:wd="urn:com.workday/bsvc" wd:version="v45.2">
            <wd:Request_References>
                <wd:Worker_Reference>
                    <wd:ID wd:type="WID">b3c518ac84321001c1c8ed9c98790000</wd:ID>
                </wd:Worker_Reference>
            </wd:Request_References>
            <wd:Response_Filter>
                <wd:Count>1</wd:Count>
            </wd:Response_Filter>
        </wd:Get_Workers_Request>
    </soap:Body>
</soap:Envelope>